[
  {
    "title": "R&D Engineer Apprentice – AI Research Team",
    "company": "Free Pro",
    "date": "Sept. 2024 - Present",
    "description": "Design and implement advanced LLM-based workflows for customer-care automation using state-of-the-art models (Qwen, Llama, Gemma, etc.), building agentic AI pipelines with tool calling, RAG, embeddings, ReAct planning, and guardrails to ensure factual, policy-compliant outputs, while deploying and optimizing large-scale AI models on specialized GPU clusters (NVIDIA H100, L40S) with vLLM and LlamaCPP, contributing to full-stack development from React/TypeScript frontends and NestJS/FastAPI backends to AI microservices and Python SDKs, managing data infrastructure with Postgres, MongoDB, and Qdrant for knowledge-base orchestration and retrieval, and maintaining GitLab/Docker CI/CD pipelines along with Linux sysadmin and network tasks across dev, pre-prod, and prod environments."
  },
  {
    "title": "AI R&D Developer – AI Research Team",
    "company": "Free Pro",
    "date": "Sept. 2023 - Sept. 2024",
    "description": "Active contribution to R&D projects in generative AI and HPC LLMs deployment. Experience in Computer Vision (OCR, DepthAI, YOLOv8), telecom (5G SA, GNodeB), and training open-source models on GPU clusters. Proficient in infrastructure workflows and associated tools. Quick Prototyping skills."
  },
  {
    "title": "R&D Developer Intern - AI Research Team",
    "company": "Free Pro",
    "date": "June 2023 - Sept. 2023",
    "description": "Implemented AI prototypes for internal business use cases. Conducted exploratory work in text generation, speech synthesis, and vector representations (embeddings)."
  },
  {
    "title": "Web Developer & Web Designer",
    "company": "LEXTAN",
    "date": "June 2022 - Aug. 2022",
    "description": "Complete redesign of the \"company\" website: UI/UX, development from scratch, and responsive integration. Delivered custom web solutions for Vivatech and JDL Expo."
  },
  {
    "title": "3D Designer – CES Scenography",
    "company": "LEXTAN",
    "date": "Jan. 2021",
    "description": "Created photorealistic 3D content and video animations for the Autopod project showcased at CES 2020. Collaborated on scenography and motion design to enhance booth visual impact."
  },
  {
    "title": "Video Game Developer",
    "company": "ISART DIGITAL Paris",
    "date": "June 2018 - July 2018",
    "description": "Two-week game development internship using Unity. Designed and developed a complete game, including gameplay mechanics and visual integration. Strengthened skills in logic, creativity, and software development."
  },
  {
    "title": "Co-founder – IZZY Project (Student Startup)",
    "company": "PÉPITE Provence",
    "date": "March 2018 - April 2018",
    "description": "2nd Prize – Jury Award at the Start’up Competition in Chicago. Developed an intelligent fatigue detection system for long-haul truck drivers, aligned with the UN Sustainable Development Goals."
  }
]
