{
  "chunks": [
    "Qui est Mathis ? \n\nMathis, 21 ans, est un étudiant passionné d'informatique et de technologie. Il poursuit sa troisième année à CPE Lyon en ingénierie informatique et travaille en alternance chez Free Pro comme apprenti ingénieur en R&D dans le Pôle IA, où il participe à des projets qui intègrent l'IA pour optimiser la productivité.",
    "Quel est le parcours de Mathis ? \n\nMathis a débuté avec un baccalauréat orienté numérique, systèmes informatiques et sciences de l'ingénieur. Il a ensuite intégré l'IUT de Toulon pour un Bachelor MMI (Multimédia et Internet) spécialisé en programmation, obtenant son BUT en 2024. Par la suite, il a rejoint la réputée école d'ingénieur CPE Lyon en alternance, dans la filière IRC (Information et Réseaux de Communication).",
    "Quelles technologies Mathis utilise-t-il ? \n\nMathis travaille avec des technologies modernes comme Python et Typescript, notamment avec des frameworks tels que React, Vite.JS et Next.JS. Il a aussi une solide expérience en développement web et mobile avec Java, et maîtrise diverses bases de données (SQL avec MariaDB et Postgres, NoSQL avec MongoDB, et vectorielles avec Qdrant). Par ailleurs, il connaît bien les outils DevOps comme Docker et utilise Git via GitHub et GitLab pour collaborer sur ses projets.",
    "Quelles sont ses compétences en intelligence artificielle ? \n\nDepuis avril 2023, lors de son stage chez Free Pro, Mathis a approfondi ses compétences en IA. Il maîtrise les modèles de langage, notamment les LLM (Large Language Models), et a participé aux premiers tests européens sur des clusters Nvidia DGX H100. Il contribue activement à la recherche et au développement de solutions IA et a travaillé sur des projets de vision par ordinateur (OpenCV, Yolo) et d'apprentissage automatique (scikit-learn, TensorFlow, PyTorch).",
    "Quelles sont ses passions ? \n\nEn dehors de l'informatique, Mathis se consacre à ses passions : le sport et la moto. Il pratique le handball depuis plus de 15 ans et participe régulièrement à des tournois. Passionné de moto, il aime parcourir les routes, que ce soit pour des balades détendues ou des sorties plus sportives. Il trouve également du réconfort dans les jeux vidéo, surtout ceux de stratégie et d'aventure.",
    "Quelles sont ses ambitions professionnelles ? \n\nMathis ambitionne de devenir une référence en intelligence artificielle et dans le développement de solutions innovantes. Il souhaite continuer à évoluer dans le secteur de l'IA et contribuer à des projets ayant un impact positif sur la société, tout en se spécialisant sur le long terme dans la recherche et le développement avec un engagement fort pour l'éthique et la responsabilité.",
    "Quelles sont ses valeurs éthiques ? \n\nMathis attache une grande importance à l'éthique et à la responsabilité dans la technologie. Il est convaincu que l'innovation doit servir l'intérêt général tout en respectant les droits individuels. Pour lui, la collaboration et le partage des connaissances sont essentiels pour construire des solutions durables et bénéfiques.",
    "A-t-il un esprit collectif ? \n\nAbsolument. Mathis valorise le travail en équipe et croit fermement que la collaboration est la clé du succès dans l'innovation. Toujours prêt à échanger des idées et à apprendre des autres, il contribue activement à un environnement de travail positif et efficace.",
    "Quelles sont ses qualités personnelles ? \n\nCurieux, motivé et déterminé, Mathis aime relever de nouveaux défis. Son sens de l'organisation et sa gestion efficace du temps lui permettent de jongler entre ses études, son travail et ses passions. Sa capacité à communiquer clairement et à travailler en équipe fait de lui un collaborateur de confiance.",
    "Quelles sont ses compétences linguistiques ? \n\nMathis maîtrise parfaitement le français et possède une bonne connaissance de l'anglais, facilitant ainsi ses échanges dans un environnement international.",
    "Quels sont ses projets futurs ? \n\nMathis envisage de continuer à se perfectionner en intelligence artificielle en participant à des projets de R&D ambitieux et en collaborant avec des experts du secteur. Il souhaite également s'investir dans des initiatives technologiques qui améliorent la qualité de vie tout en promouvant un usage éthique de l'IA.",
    "Qu'est-ce qui motive Mathis ? \n\nSa passion pour l'innovation et le désir de créer des solutions technologiques à fort impact le motivent au quotidien. Toujours en quête de nouvelles connaissances, il voit chaque défi comme une opportunité de grandir et d'apporter sa contribution au monde de la technologie."
  ]
}
