{
  "chunks": [
    "Identity: Mathis Lambert. Contact information: Email mathis.lambert27@gmail.com, Phone 06 51 05 01 67, LinkedIn mathis-lambert, Website mathislambert.fr.",
    "Professional summary: Passionate about artificial intelligence, machine learning, and data science. Strong focus on building practical and innovative solutions in collaborative environments. Values continuous learning, technical reliability, and hands-on project experience.",
    "Experience: Free Pro, Marseille, France. Role: Apprentice R&D Engineer in AI Research (previously R&D Intern). Period: April 2023 – Present.",
    "At Free Pro: Progressed from R&D Intern to Apprentice Engineer. Specialized in transformer models including large language models (LLMs) and time series models.",
    "At Free Pro: Gained expertise in dataset design and fine-tuning methods such as supervised fine-tuning (SFT), direct preference optimization (DPO), and low-rank adaptation (LoRA).",
    "At Free Pro: Deployed large-scale AI workloads on high-performance computing (HPC) infrastructures using Nvidia H100 clusters. Tools: Docker, Nvidia NGC, Slurm workload manager.",
    "At Free Pro: Built applied computer vision systems. Example: OCR pipelines with DepthAI on Raspberry Pi, and object detection models with OpenCV and YOLOv8.",
    "Experience: LEXTAN, Gémenos, France. Role: Junior Web Developer & Webdesigner. Period: June 2022 – August 2022.",
    "At LEXTAN: Led a complete redesign and development of the corporate website from scratch. Delivered a modern and functional digital presence.",
    "At LEXTAN: Developed tailored web solutions for large technology events including Vivatech and JDL Expo 2022.",
    "Experience: Startup project IZZY. Pépite Provence & UN 2030 Goals program. Location: Chicago, USA. Period: March 2018 – April 2018.",
    "Project IZZY: Co-developed an intelligent system to combat driver fatigue in long-haul trucking. Solution designed for real-world transport applications.",
    "Project IZZY: Awarded 2nd Place Jury Prize at the Start'up Competition in Chicago. Recognized for innovation and societal impact.",
    "Project IZZY: Designed to align with UN 2030 Sustainable Development Goals, emphasizing health, safety, and sustainability.",
    "Education: CPE Lyon. Degree: Computer Science, Ingénierie informatique. Period: 2024 – 2027.",
    "Education: Université de Toulon. Degree: Bachelor (BUT) Multimédia et Métiers de l’Internet. Period: 2021 – 2024.",
    "Technologies: Proficient in Python, PyTorch, transformer-based LLMs (Mistral, LLaMA). Experienced with HPC infrastructures and Slurm scheduling.",
    "Technologies: Skilled in containerization and deployment using Docker and Nvidia NGC. Backend development with Node.js and MongoDB. Frontend development with React, JavaScript, and TypeScript.",
    "Technologies: Computer vision expertise using OpenCV and YOLO for detection and recognition tasks.",
    "Skills: Artificial intelligence and machine learning. Fine-tuning techniques including LoRA and DPO. Experience with 5G standalone (SA) infrastructure.",
    "Skills: Strong in public speaking, agile methodologies, and structured problem solving.",
    "Passions and interests: Enthusiastic about video games, handball, motorbiking, mechanics, and hardware tinkering."
  ]
}
